fluid/engine2Valve2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    piston
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    liner
    {
        type            noSlip;
    }

    cylinderHead
    {
        type            noSlip;
    }

    ivHead
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    ivStem
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    evHead
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    evStem
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    frontAndBack
    {
        type            empty;
    }

    "nonCouple.*"
    {
        type            slip;
    }
}


// ************************************************************************* //
