fluid/engine2Valve2D/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh

# Copy the start time mesh
cp -r constant/meshToMesh_0/polyMesh constant/

runApplication $(getApplication)

#------------------------------------------------------------------------------
