fluid/engine2Valve2D/constant/expData/pInlet
# Intake pressure profile
#CAD    bar
0       1.0
340     1.5
480     1.6
620     1.5
720     1.0
